<?php

/**
* @charset UTF-8
*/

/**
 * Задание 5. Html. CSS. Javascript
 *
 * Создать HTML страницу с адаптивным дизайном под любое устройство. Можно использовать bootstrap.
 *
 * По центру:
 * - Заголовок "Олимпиада"
 * - Поле ввода с лейблом "Участники", плейсхолдер "введите имена участников через запятую" (доступны только кириллические буквы и запятая)
 * - Кнопка "Добавить" (должна реагировать не только на щелчок мышью, но и на нажатие enter)
 *
 * При первом нажатии на кнопку должна появляться таблица с полями: id, имя, очки. Поле ввода "Участники" должно становиться пустым. Плейсхолдер при этом прежний.
 * - id - это порядковый номер в списке участников, который ввёл пользователь.
 * - очки для каждого участника сгеренировать рандомно.
 *
 * Все столбцы таблицы должны быть сортируемыми при нажатии на заголовок столбца.
 *
 * Если таблица уже отобразилась, то снова при нажатии на кнопку "Добавить" в таблицу должны добавляться участники, которых дописали.
 *
 * Все ошибки пользователя при добавлении участников выводить через модальное окно с небольшим описанием, чтобы пользователь мог исправиться.
 */
